watermeer/Low-Power-Outdoor-Safety-Watch/SDK/GD32L23x_Firmware_Library_V2.4.0/Firmware/GD32L23x_standard_peripheral/Include/gd32l23x_can.h
/*!
    \file    gd32l23x_can.h
    \brief   definitions for the CAN

    \version 2026-02-02, V2.4.0, firmware for GD32L23x, add support for GD32L235
*/

/*
    Copyright (c) 2026, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#ifdef GD32L235

#ifndef GD32L23X_CAN_H
#define GD32L23X_CAN_H

#include "gd32l23x.h"

/* CAN definitions */
#define CAN                          CAN_BASE                                /*!< CAN base address */

/* registers definitions */
#define CAN_CTL                      REG32((CAN) + 0x00000000U)              /*!< CAN control register */
#define CAN_STAT                     REG32((CAN) + 0x00000004U)              /*!< CAN status register */
#define CAN_TSTAT                    REG32((CAN) + 0x00000008U)              /*!< CAN transmit status register*/
#define CAN_RFIFO0                   REG32((CAN) + 0x0000000CU)              /*!< CAN receive FIFO0 register */
#define CAN_RFIFO1                   REG32((CAN) + 0x00000010U)              /*!< CAN receive FIFO1 register */
#define CAN_INTEN                    REG32((CAN) + 0x00000014U)              /*!< CAN interrupt enable register */
#define CAN_ERR                      REG32((CAN) + 0x00000018U)              /*!< CAN error register */
#define CAN_BT                       REG32((CAN) + 0x0000001CU)              /*!< CAN bit timing register */
#define CAN_TMI0                     REG32((CAN) + 0x00000180U)              /*!< CAN transmit mailbox0 identifier register */
#define CAN_TMP0                     REG32((CAN) + 0x00000184U)              /*!< CAN transmit mailbox0 property register */
#define CAN_TMDATA00                 REG32((CAN) + 0x00000188U)              /*!< CAN transmit mailbox0 data0 register */
#define CAN_TMDATA10                 REG32((CAN) + 0x0000018CU)              /*!< CAN transmit mailbox0 data1 register */
#define CAN_TMI1                     REG32((CAN) + 0x00000190U)              /*!< CAN transmit mailbox1 identifier register */
#define CAN_TMP1                     REG32((CAN) + 0x00000194U)              /*!< CAN transmit mailbox1 property register */
#define CAN_TMDATA01                 REG32((CAN) + 0x00000198U)              /*!< CAN transmit mailbox1 data0 register */
#define CAN_TMDATA11                 REG32((CAN) + 0x0000019CU)              /*!< CAN transmit mailbox1 data1 register */
#define CAN_TMI2                     REG32((CAN) + 0x000001A0U)              /*!< CAN transmit mailbox2 identifier register */
#define CAN_TMP2                     REG32((CAN) + 0x000001A4U)              /*!< CAN transmit mailbox2 property register */
#define CAN_TMDATA02                 REG32((CAN) + 0x000001A8U)              /*!< CAN transmit mailbox2 data0 register */
#define CAN_TMDATA12                 REG32((CAN) + 0x000001ACU)              /*!< CAN transmit mailbox2 data1 register */
#define CAN_RFIFOMI0                 REG32((CAN) + 0x000001B0U)              /*!< CAN receive FIFO0 mailbox identifier register */
#define CAN_RFIFOMP0                 REG32((CAN) + 0x000001B4U)              /*!< CAN receive FIFO0 mailbox property register */
#define CAN_RFIFOMDATA00             REG32((CAN) + 0x000001B8U)              /*!< CAN receive FIFO0 mailbox data0 register */
#define CAN_RFIFOMDATA10             REG32((CAN) + 0x000001BCU)              /*!< CAN receive FIFO0 mailbox data1 register */
#define CAN_RFIFOMI1                 REG32((CAN) + 0x000001C0U)              /*!< CAN receive FIFO1 mailbox identifier register */
#define CAN_RFIFOMP1                 REG32((CAN) + 0x000001C4U)              /*!< CAN receive FIFO1 mailbox property register */
#define CAN_RFIFOMDATA01             REG32((CAN) + 0x000001C8U)              /*!< CAN receive FIFO1 mailbox data0 register */
#define CAN_RFIFOMDATA11             REG32((CAN) + 0x000001CCU)              /*!< CAN receive FIFO1 mailbox data1 register */
#define CAN_FCTL                     REG32((CAN) + 0x00000200U)              /*!< CAN filter control register */
#define CAN_FMCFG                    REG32((CAN) + 0x00000204U)              /*!< CAN filter mode register */
#define CAN_FSCFG                    REG32((CAN) + 0x0000020CU)              /*!< CAN filter scale register */
#define CAN_FAFIFO                   REG32((CAN) + 0x00000214U)              /*!< CAN filter associated FIFO register */
#define CAN_FW                       REG32((CAN) + 0x0000021CU)              /*!< CAN filter working register */
#define CAN_F0DATA0                  REG32((CAN) + 0x00000240U)              /*!< CAN filter 0 data 0 register */
#define CAN_F1DATA0                  REG32((CAN) + 0x00000248U)              /*!< CAN filter 1 data 0 register */
#define CAN_F2DATA0                  REG32((CAN) + 0x00000250U)              /*!< CAN filter 2 data 0 register */
#define CAN_F3DATA0                  REG32((CAN) + 0x00000258U)              /*!< CAN filter 3 data 0 register */
#define CAN_F4DATA0                  REG32((CAN) + 0x00000260U)              /*!< CAN filter 4 data 0 register */
#define CAN_F5DATA0                  REG32((CAN) + 0x00000268U)              /*!< CAN filter 5 data 0 register */
#define CAN_F6DATA0                  REG32((CAN) + 0x00000270U)              /*!< CAN filter 6 data 0 register */
#define CAN_F7DATA0                  REG32((CAN) + 0x00000278U)              /*!< CAN filter 7 data 0 register */
#define CAN_F8DATA0                  REG32((CAN) + 0x00000280U)              /*!< CAN filter 8 data 0 register */
#define CAN_F9DATA0                  REG32((CAN) + 0x00000288U)              /*!< CAN filter 9 data 0 register */
#define CAN_F10DATA0                 REG32((CAN) + 0x00000290U)              /*!< CAN filter 10 data 0 register */
#define CAN_F11DATA0                 REG32((CAN) + 0x00000298U)              /*!< CAN filter 11 data 0 register */
#define CAN_F12DATA0                 REG32((CAN) + 0x000002A0U)              /*!< CAN filter 12 data 0 register */
#define CAN_F13DATA0                 REG32((CAN) + 0x000002A8U)              /*!< CAN filter 13 data 0 register */
#define CAN_F14DATA0                 REG32((CAN) + 0x000002B0U)              /*!< CAN filter 14 data 0 register */
#define CAN_F15DATA0                 REG32((CAN) + 0x000002B8U)              /*!< CAN filter 15 data 0 register */
#define CAN_F16DATA0                 REG32((CAN) + 0x000002C0U)              /*!< CAN filter 16 data 0 register */
#define CAN_F17DATA0                 REG32((CAN) + 0x000002C8U)              /*!< CAN filter 17 data 0 register */
#define CAN_F18DATA0                 REG32((CAN) + 0x000002D0U)              /*!< CAN filter 18 data 0 register */
#define CAN_F19DATA0                 REG32((CAN) + 0x000002D8U)              /*!< CAN filter 19 data 0 register */
#define CAN_F20DATA0                 REG32((CAN) + 0x000002E0U)              /*!< CAN filter 20 data 0 register */
#define CAN_F21DATA0                 REG32((CAN) + 0x000002E8U)              /*!< CAN filter 21 data 0 register */
#define CAN_F22DATA0                 REG32((CAN) + 0x000002F0U)              /*!< CAN filter 22 data 0 register */
#define CAN_F23DATA0                 REG32((CAN) + 0x000002F8U)              /*!< CAN filter 23 data 0 register */
#define CAN_F24DATA0                 REG32((CAN) + 0x00000300U)              /*!< CAN filter 24 data 0 register */
#define CAN_F25DATA0                 REG32((CAN) + 0x00000308U)              /*!< CAN filter 25 data 0 register */
#define CAN_F26DATA0                 REG32((CAN) + 0x00000310U)              /*!< CAN filter 26 data 0 register */
#define CAN_F27DATA0                 REG32((CAN) + 0x00000318U)              /*!< CAN filter 27 data 0 register */
#define CAN_F0DATA1                  REG32((CAN) + 0x00000244U)              /*!< CAN filter 0 data 1 register */
#define CAN_F1DATA1                  REG32((CAN) + 0x0000024CU)              /*!< CAN filter 1 data 1 register */
#define CAN_F2DATA1                  REG32((CAN) + 0x00000254U)              /*!< CAN filter 2 data 1 register */
#define CAN_F3DATA1                  REG32((CAN) + 0x0000025CU)              /*!< CAN filter 3 data 1 register */
#define CAN_F4DATA1                  REG32((CAN) + 0x00000264U)              /*!< CAN filter 4 data 1 register */
#define CAN_F5DATA1                  REG32((CAN) + 0x0000026CU)              /*!< CAN filter 5 data 1 register */
#define CAN_F6DATA1                  REG32((CAN) + 0x00000274U)              /*!< CAN filter 6 data 1 register */
#define CAN_F7DATA1                  REG32((CAN) + 0x0000027CU)              /*!< CAN filter 7 data 1 register */
#define CAN_F8DATA1                  REG32((CAN) + 0x00000284U)              /*!< CAN filter 8 data 1 register */
#define CAN_F9DATA1                  REG32((CAN) + 0x0000028CU)              /*!< CAN filter 9 data 1 register */
#define CAN_F10DATA1                 REG32((CAN) + 0x00000294U)              /*!< CAN filter 10 data 1 register */
#define CAN_F11DATA1                 REG32((CAN) + 0x0000029CU)              /*!< CAN filter 11 data 1 register */
#define CAN_F12DATA1                 REG32((CAN) + 0x000002A4U)              /*!< CAN filter 12 data 1 register */
#define CAN_F13DATA1                 REG32((CAN) + 0x000002ACU)              /*!< CAN filter 13 data 1 register */
#define CAN_F14DATA1                 REG32((CAN) + 0x000002B4U)              /*!< CAN filter 14 data 1 register */
#define CAN_F15DATA1                 REG32((CAN) + 0x000002BCU)              /*!< CAN filter 15 data 1 register */
#define CAN_F16DATA1                 REG32((CAN) + 0x000002C4U)              /*!< CAN filter 16 data 1 register */
#define CAN_F17DATA1                 REG32((CAN) + 0x000002CCU)              /*!< CAN filter 17 data 1 register */
#define CAN_F18DATA1                 REG32((CAN) + 0x000002D4U)              /*!< CAN filter 18 data 1 register */
#define CAN_F19DATA1                 REG32((CAN) + 0x000002DCU)              /*!< CAN filter 19 data 1 register */
#define CAN_F20DATA1                 REG32((CAN) + 0x000002E4U)              /*!< CAN filter 20 data 1 register */
#define CAN_F21DATA1                 REG32((CAN) + 0x000002ECU)              /*!< CAN filter 21 data 1 register */
#define CAN_F22DATA1                 REG32((CAN) + 0x000002F4U)              /*!< CAN filter 22 data 1 register */
#define CAN_F23DATA1                 REG32((CAN) + 0x000002FCU)              /*!< CAN filter 23 data 1 register */
#define CAN_F24DATA1                 REG32((CAN) + 0x00000304U)              /*!< CAN filter 24 data 1 register */
#define CAN_F25DATA1                 REG32((CAN) + 0x0000030CU)              /*!< CAN filter 25 data 1 register */
#define CAN_F26DATA1                 REG32((CAN) + 0x00000314U)              /*!< CAN filter 26 data 1 register */
#define CAN_F27DATA1                 REG32((CAN) + 0x0000031CU)              /*!< CAN filter 27 data 1 register */

/* CAN transmit mailbox bank */
#define CAN_TMI(bank)                REG32((CAN) + 0x180U + ((bank) * 0x10U))        /*!< CAN transmit mailbox identifier register */
#define CAN_TMP(bank)                REG32((CAN) + 0x184U + ((bank) * 0x10U))        /*!< CAN transmit mailbox property register */
#define CAN_TMDATA0(bank)            REG32((CAN) + 0x188U + ((bank) * 0x10U))        /*!< CAN transmit mailbox data0 register */
#define CAN_TMDATA1(bank)            REG32((CAN) + 0x18CU + ((bank) * 0x10U))        /*!< CAN transmit mailbox data1 register */

/* CAN filter bank */
#define CAN_FDATA0(bank)             REG32((CAN) + 0x240U + ((bank) * 0x8U) + 0x0U)  /*!< CAN filter data 0 register */
#define CAN_FDATA1(bank)             REG32((CAN) + 0x240U + ((bank) * 0x8U) + 0x4U)  /*!< CAN filter data 1 register */

/* CAN receive fifo mailbox bank */
#define CAN_RFIFOMI(bank)            REG32((CAN) + 0x1B0U + ((bank) * 0x10U))        /*!< CAN receive FIFO mailbox identifier register */
#define CAN_RFIFOMP(bank)            REG32((CAN) + 0x1B4U + ((bank) * 0x10U))        /*!< CAN receive FIFO mailbox property register */
#define CAN_RFIFOMDATA0(bank)        REG32((CAN) + 0x1B8U + ((bank) * 0x10U))        /*!< CAN receive FIFO mailbox data0 register */
#define CAN_RFIFOMDATA1(bank)        REG32((CAN) + 0x1BCU + ((bank) * 0x10U))        /*!< CAN receive FIFO mailbox data1 register */

