watermeer/Low-Power-Outdoor-Safety-Watch/SDK/GD32L23x_Firmware_Library_V2.4.0/Firmware/GD32L23x_standard_peripheral/Include/gd32l23x_can.h
/* bits definitions */
/* CAN_CTL */
#define CAN_CTL_IWMOD                BIT(0)                             /*!< initial working mode */
#define CAN_CTL_SLPWMOD              BIT(1)                             /*!< sleep working mode */
#define CAN_CTL_TFO                  BIT(2)                             /*!< transmit FIFO order */
#define CAN_CTL_RFOD                 BIT(3)                             /*!< receive FIFO overwrite disable */
#define CAN_CTL_ARD                  BIT(4)                             /*!< automatic retransmission disable */
#define CAN_CTL_AWU                  BIT(5)                             /*!< automatic wakeup */
#define CAN_CTL_ABOR                 BIT(6)                             /*!< automatic bus-off recovery */
#define CAN_CTL_TTC                  BIT(7)                             /*!< time triggered communication */
#define CAN_CTL_SWRST                BIT(15)                            /*!< CAN software reset */
#define CAN_CTL_DFZ                  BIT(16)                            /*!< CAN debug freeze */

/* CAN_STAT */
#define CAN_STAT_IWS                 BIT(0)                             /*!< initial working state */
#define CAN_STAT_SLPWS               BIT(1)                             /*!< sleep working state */
#define CAN_STAT_ERRIF               BIT(2)                             /*!< error interrupt flag*/
#define CAN_STAT_WUIF                BIT(3)                             /*!< status change interrupt flag of wakeup from sleep working mode */
#define CAN_STAT_SLPIF               BIT(4)                             /*!< status change interrupt flag of sleep working mode entering */
#define CAN_STAT_TS                  BIT(8)                             /*!< transmitting state */
#define CAN_STAT_RS                  BIT(9)                             /*!< receiving state */
#define CAN_STAT_LASTRX              BIT(10)                            /*!< last sample value of rx pin */
#define CAN_STAT_RXL                 BIT(11)                            /*!< CAN rx signal */

/* CAN_TSTAT */
#define CAN_TSTAT_MTF0               BIT(0)                             /*!< mailbox0 transmit finished */
#define CAN_TSTAT_MTFNERR0           BIT(1)                             /*!< mailbox0 transmit finished and no error */
#define CAN_TSTAT_MAL0               BIT(2)                             /*!< mailbox0 arbitration lost */
#define CAN_TSTAT_MTE0               BIT(3)                             /*!< mailbox0 transmit error */
#define CAN_TSTAT_MST0               BIT(7)                             /*!< mailbox0 stop transmitting */
#define CAN_TSTAT_MTF1               BIT(8)                             /*!< mailbox1 transmit finished */
#define CAN_TSTAT_MTFNERR1           BIT(9)                             /*!< mailbox1 transmit finished and no error */
#define CAN_TSTAT_MAL1               BIT(10)                            /*!< mailbox1 arbitration lost */
#define CAN_TSTAT_MTE1               BIT(11)                            /*!< mailbox1 transmit error */
#define CAN_TSTAT_MST1               BIT(15)                            /*!< mailbox1 stop transmitting */
#define CAN_TSTAT_MTF2               BIT(16)                            /*!< mailbox2 transmit finished */
#define CAN_TSTAT_MTFNERR2           BIT(17)                            /*!< mailbox2 transmit finished and no error */
#define CAN_TSTAT_MAL2               BIT(18)                            /*!< mailbox2 arbitration lost */
#define CAN_TSTAT_MTE2               BIT(19)                            /*!< mailbox2 transmit error */
#define CAN_TSTAT_MST2               BIT(23)                            /*!< mailbox2 stop transmitting */
#define CAN_TSTAT_NUM                BITS(24,25)                        /*!< mailbox number */
#define CAN_TSTAT_TME0               BIT(26)                            /*!< transmit mailbox0 empty */
#define CAN_TSTAT_TME1               BIT(27)                            /*!< transmit mailbox1 empty */
#define CAN_TSTAT_TME2               BIT(28)                            /*!< transmit mailbox2 empty */
#define CAN_TSTAT_TMLS0              BIT(29)                            /*!< last sending priority flag for mailbox0 */
#define CAN_TSTAT_TMLS1              BIT(30)                            /*!< last sending priority flag for mailbox1 */
#define CAN_TSTAT_TMLS2              BIT(31)                            /*!< last sending priority flag for mailbox2 */

/* CAN_RFIFO0 */
#define CAN_RFIFO0_RFL0              BITS(0,1)                          /*!< receive FIFO0 length */
#define CAN_RFIFO0_RFF0              BIT(3)                             /*!< receive FIFO0 full */
#define CAN_RFIFO0_RFO0              BIT(4)                             /*!< receive FIFO0 overfull */
#define CAN_RFIFO0_RFD0              BIT(5)                             /*!< receive FIFO0 dequeue */

/* CAN_RFIFO1 */
#define CAN_RFIFO1_RFL1              BITS(0,1)                          /*!< receive FIFO1 length */
#define CAN_RFIFO1_RFF1              BIT(3)                             /*!< receive FIFO1 full */
#define CAN_RFIFO1_RFO1              BIT(4)                             /*!< receive FIFO1 overfull */
#define CAN_RFIFO1_RFD1              BIT(5)                             /*!< receive FIFO1 dequeue */

/* CAN_INTEN */
#define CAN_INTEN_TMEIE              BIT(0)                             /*!< transmit mailbox empty interrupt enable */
#define CAN_INTEN_RFNEIE0            BIT(1)                             /*!< receive FIFO0 not empty interrupt enable */
#define CAN_INTEN_RFFIE0             BIT(2)                             /*!< receive FIFO0 full interrupt enable */
#define CAN_INTEN_RFOIE0             BIT(3)                             /*!< receive FIFO0 overfull interrupt enable */
#define CAN_INTEN_RFNEIE1            BIT(4)                             /*!< receive FIFO1 not empty interrupt enable */
#define CAN_INTEN_RFFIE1             BIT(5)                             /*!< receive FIFO1 full interrupt enable */
#define CAN_INTEN_RFOIE1             BIT(6)                             /*!< receive FIFO1 overfull interrupt enable */
#define CAN_INTEN_WERRIE             BIT(8)                             /*!< warning error interrupt enable */
#define CAN_INTEN_PERRIE             BIT(9)                             /*!< passive error interrupt enable */
#define CAN_INTEN_BOIE               BIT(10)                            /*!< bus-off interrupt enable */
#define CAN_INTEN_ERRNIE             BIT(11)                            /*!< error number interrupt enable */
#define CAN_INTEN_ERRIE              BIT(15)                            /*!< error interrupt enable */
#define CAN_INTEN_WIE                BIT(16)                            /*!< wakeup interrupt enable */
#define CAN_INTEN_SLPWIE             BIT(17)                            /*!< sleep working interrupt enable */

/* CAN_ERR */
#define CAN_ERR_WERR                 BIT(0)                             /*!< warning error */
#define CAN_ERR_PERR                 BIT(1)                             /*!< passive error */
#define CAN_ERR_BOERR                BIT(2)                             /*!< bus-off error */
#define CAN_ERR_ERRN                 BITS(4,6)                          /*!< error number */
#define CAN_ERR_TECNT                BITS(16,23)                        /*!< transmit error count */
#define CAN_ERR_RECNT                BITS(24,31)                        /*!< receive error count */

/* CAN_BT */
#define CAN_BT_BAUDPSC               BITS(0,9)                          /*!< baudrate prescaler */
#define CAN_BT_BS1                   BITS(16,19)                        /*!< bit segment 1 */
#define CAN_BT_BS2                   BITS(20,22)                        /*!< bit segment 2 */
#define CAN_BT_SJW                   BITS(24,25)                        /*!< resynchronization jump width */
#define CAN_BT_LCMOD                 BIT(30)                            /*!< loopback communication mode */
#define CAN_BT_SCMOD                 BIT(31)                            /*!< silent communication mode */

/* CAN_TMIx */
#define CAN_TMI_TEN                  BIT(0)                             /*!< transmit enable */
#define CAN_TMI_FT                   BIT(1)                             /*!< frame type */
#define CAN_TMI_FF                   BIT(2)                             /*!< frame format */
#define CAN_TMI_EFID                 BITS(3,31)                         /*!< the frame identifier */
#define CAN_TMI_SFID                 BITS(21,31)                        /*!< the frame identifier */

/* CAN_TMPx */
#define CAN_TMP_DLENC                BITS(0,3)                          /*!< data length code */
#define CAN_TMP_TSEN                 BIT(8)                             /*!< time stamp enable */
#define CAN_TMP_TS                   BITS(16,31)                        /*!< time stamp */

/* CAN_TMDATA0x */
#define CAN_TMDATA0_DB0              BITS(0,7)                          /*!< transmit data byte 0 */
#define CAN_TMDATA0_DB1              BITS(8,15)                         /*!< transmit data byte 1 */
#define CAN_TMDATA0_DB2              BITS(16,23)                        /*!< transmit data byte 2 */
#define CAN_TMDATA0_DB3              BITS(24,31)                        /*!< transmit data byte 3 */

/* CAN_TMDATA1x */
#define CAN_TMDATA1_DB4              BITS(0,7)                          /*!< transmit data byte 4 */
#define CAN_TMDATA1_DB5              BITS(8,15)                         /*!< transmit data byte 5 */
#define CAN_TMDATA1_DB6              BITS(16,23)                        /*!< transmit data byte 6 */
#define CAN_TMDATA1_DB7              BITS(24,31)                        /*!< transmit data byte 7 */

/* CAN_RFIFOMIx */
#define CAN_RFIFOMI_FT               BIT(1)                             /*!< frame type */
#define CAN_RFIFOMI_FF               BIT(2)                             /*!< frame format */
#define CAN_RFIFOMI_EFID             BITS(3,31)                         /*!< the frame identifier */
#define CAN_RFIFOMI_SFID             BITS(21,31)                        /*!< the frame identifier */

/* CAN_RFIFOMPx */
#define CAN_RFIFOMP_DLENC            BITS(0,3)                          /*!< receive data length code */
#define CAN_RFIFOMP_FI               BITS(8,15)                         /*!< filter index */
#define CAN_RFIFOMP_TS               BITS(16,31)                        /*!< time stamp */

